Revit 2027 API
FabricationPart.HandlePosition Property
 Position of the handle of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationHandlePosition HandlePosition { get; set; }
Public Property HandlePosition As FabricationHandlePosition
	Get
	Set
public:
property FabricationHandlePosition HandlePosition {
	FabricationHandlePosition get ();
	void set (FabricationHandlePosition value);
}
member HandlePosition : FabricationHandlePosition with get, set
Property Value
FabricationHandlePosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace